&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("Администратор") Тогда
		Элементы.ДатаФактическогоВыполнения.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ТочкаМаршрута = БизнесПроцессы.Исполнение.ТочкиМаршрута.Проверка Тогда
		Элементы.ПроверкаПройдена.Видимость = Истина;
	Иначе
		Элементы.ПроверкаПройдена.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	Возврат РаботаСТекущимПользователемПолныеПрава.ПолучитьТекущегоПользователя();
КонецФункции

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Объект.ДатаФактическогоВыполнения = ТекущаяДата();
	Объект.ФактическиеИсполнитель = ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверкаПройденаПриИзмененииНаСервере(БизнесПроцессСсылка, ПроверкаПройдена)
	БизнесПроцесс = БизнесПроцессСсылка.ПолучитьОбъект();
	БизнесПроцесс.ПроверкаПройдена = ПроверкаПройдена;
	БизнесПроцесс.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПройденаПриИзменении(Элемент)
	ПроверкаПройденаПриИзмененииНаСервере(Объект.БизнесПроцесс, ПроверкаПройдена);
КонецПроцедуры
