
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьПолей()
	
	Если ЯвляетсяДоговором(Объект.Вид) Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицоКонтрагента.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицоКонтрагента.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЯвляетсяДоговором(ВидДокументаСсылка)
	Вид = ВидДокументаСсылка.ПолучитьОбъект();
	Возврат Вид.ЯвляетсяДоговором;
КонецФункции