
Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(Наименование) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Идентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
	Иначе
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Роль) Тогда
		ВыбраннаяРоль = Метаданные.Роли.Найти(Роль);
		Если ВыбраннаяРоль = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Пользователь.Роли.Добавить(ВыбраннаяРоль);
	КонецЕсли;
	
	Пользователь.Записать();
	Идентификатор = Пользователь.УникальныйИдентификатор;
КонецПроцедуры