Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ПользовательИБ.УникальныйИдентификатор);
	
	Если ТекПользователь.Пустая() Тогда
		НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовПользователь.Наименование = ПользовательИБ.Имя;
		НовПользователь.Идентификатор = ПользовательИБ.УникальныйИдентификатор;
		НовПользователь.Записать();
		ТекПользователь = НовПользователь.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
	
КонецПроцедуры