
Процедура ЗадачаВыполненаУспешноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПроверкаПройдена;
КонецПроцедуры

Процедура ПроверкаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Запрос = Комментарий;
	ФормируемыеЗадачи[0].Пользователь = Автор;
КонецПроцедуры


Процедура ВыполнитьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Комментарий = Задача.Комментарий;
КонецПроцедуры

Процедура ВыполнитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Пользователь = Исполнитель;
КонецПроцедуры
